Repository: Abish111204/medigo_docter
Catalog: lib/l10n/app_*.arb
Languages: ml

source: Welcome Back!
ml: വീണ്ടും സ്വാഗതം!

# createAccount
source: Create an Account
ml: ഒരു അക്കൗണ്ട് സൃഷ്ടിക്കുക

source: Sign in to continue
ml: തുടരാൻ സൈൻ ഇൻ ചെയ്യുക

# fillDetails
source: Please fill in the details to sign up
ml: സൈൻ അപ്പ് ചെയ്യുന്നതിന് ദയവായി വിശദാംശങ്ങൾ പൂരിപ്പിക്കുക

source: Sign In
ml: സൈൻ ഇൻ ചെയ്യുക

source: Sign Up
ml: സൈൻ അപ്പ് ചെയ്യുക

source: Confirm Emergency Call
ml: അടിയന്തര കോൾ സ്ഥിരീകരിക്കുക

source: Home
ml: ഹോം

source: Shops
ml: കടകൾ

source: Booking
ml: ബുക്കിംഗ്

source: Please fill all fields
ml: ദയവായി എല്ലാ ഫീൽഡുകളും പൂരിപ്പിക്കുക

source: Booking Successful!
ml: ബുക്കിംഗ് വിജയിച്ചു!

source: Booking Failed
ml: ബുക്കിംഗ് പരാജയപ്പെട്ടു

source: Appointment Date
ml: അപ്പോയിന്റ്മെന്റ് തീയതി

source: Profile Updated
ml: പ്രൊഫൈൽ അപ്ഡേറ്റ് ചെയ്തു

source: Save Changes
ml: മാറ്റങ്ങൾ സംരക്ഷിക്കുക

source: Full Name
ml: മുഴുവൻ പേര്

source: Phone Number
ml: ഫോൺ നമ്പർ

# dob
source: Date of Birth
ml: ജനന തീയതി

source: Email
ml: ഇമെയിൽ

source: Password
ml: പാസ്സ്വേർഡ്

source: Forgot Password?
ml: പാസ്സ്വേർഡ് മറന്നോ?

# dontHaveAccount
source: Don't have an account?
ml: അക്കൗണ്ട് ഇല്ലേ?

# haveAccount
source: Already have an account?
ml: അക്കൗണ്ട് ഉണ്ടോ?

source: Cancel
ml: റദ്ദാക്കുക

source: Confirm
ml: സ്ഥിരീകരിക്കുക

source: Settings
ml: ക്രമീകരണങ്ങൾ

# validation_pleaseEnterPlace
source: Please enter a place to search
ml: തിരയാൻ ഒരു സ്ഥലം നൽകുക

# validation_pleaseSelectSpecialization
source: Please select a specialization
ml: ഒരു സ്പെഷ്യലൈസേഷൻ തിരഞ്ഞെടുക്കുക

source: Find Your Care
ml: നിങ്ങളുടെ പരിചരണം കണ്ടെത്തുക

# searchHospitals
source: Search Hospitals & Clinics
ml: ആശുപത്രികളും ക്ലിനിക്കുകളും തിരയുക

source: Search by place
ml: സ്ഥലം അനുസരിച്ച് തിരയുക

source: Hospital
ml: ആശുപത്രി

source: Clinic
ml: ക്ലിനിക്ക്

source: Select Specialization
ml: സ്പെഷ്യലൈസേഷൻ തിരഞ്ഞെടുക്കുക

source: Search
ml: തിരയുക

source: Results
ml: ഫലങ്ങൾ

source: Book
ml: ബുക്ക്

source: Find Your Shop
ml: നിങ്ങളുടെ കട കണ്ടെത്തുക

# searchPharmacies
source: Search Pharmacies & Equipment
ml: ഫാർമസികളും ഉപകരണങ്ങളും തിരയുക

source: Pharmacies
ml: ഫാർമസികൾ

source: Equipment
ml: ഉപകരണങ്ങൾ

source: Your Bookings
ml: നിങ്ങളുടെ ബുക്കിംഗുകൾ

# noAppointments
source: You have no upcoming appointments.
ml: ഈ ദിവസം അപ്പോയിന്റ്മെന്റുകളൊന്നുമില്ല.

source: Patient Details
ml: രോഗിയുടെ വിവരങ്ങൾ

source: Profile
ml: പ്രൊഫൈൽ

source: Not Set
ml: സജ്ജീകരിച്ചിട്ടില്ല

source: No name set
ml: പേര് സജ്ജീകരിച്ചിട്ടില്ല

source: No phone set
ml: ഫോൺ നമ്പർ സജ്ജീകരിച്ചിട്ടില്ല

source: Book Appointment
ml: അപ്പോയിന്റ്മെന്റ് ബുക്ക് ചെയ്യുക

# patientName
source: Patient's Name
ml: രോഗിയുടെ പേര്

# patientAge
source: Patient's Age
ml: രോഗിയുടെ പ്രായം

source: Gender
ml: ലിംഗം

source: Male
ml: പുരുഷൻ

source: Female
ml: സ്ത്രീ

source: Other
ml: മറ്റുള്ളവ

source: Select Date
ml: ഒരു തീയതി തിരഞ്ഞെടുക്കുക

source: Select Time
ml: സമയം തിരഞ്ഞെടുക്കുക

source: Confirm Booking
ml: ബുക്കിംഗ് സ്ഥിരീകരിക്കുക

source: Edit Profile
ml: പ്രൊഫൈൽ എഡിറ്റ് ചെയ്യുക

source: Select Language
ml: ഭാഷ തിരഞ്ഞെടുക്കുക

source: Preferences
ml: മുൻഗണനകൾ

source: Dark Theme
ml: ഡാർക്ക് തീം

source: Notifications
ml: അറിയിപ്പുകൾ

source: Language
ml: ഭാഷ

source: About MediGo
ml: MediGo-യെക്കുറിച്ച്

# aboutMediGoContent
source: MediGo is a platform to connect patients with doctors and medical facilities seamlessly. Find care, book appointments, and manage your health.
ml: രോഗികളെ ഡോക്ടർമാരുമായും മെഡിക്കൽ സൗകര്യങ്ങളുമായും സുഗമമായി ബന്ധിപ്പിക്കുന്നതിനുള്ള ഒരു പ്ലാറ്റ്ഫോമാണ് MediGo. പരിചരണം കണ്ടെത്തുക, അപ്പോയിന്റ്മെന്റുകൾ ബുക്ക് ചെയ്യുക, നിങ്ങളുടെ ആരോഗ്യം നിയന്ത്രിക്കുക.

source: Logout
ml: ലോഗ്ഔട്ട്

source: Confirm Password
ml: പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക

source: Passwords do not match
ml: പാസ്‌വേഡ് പൊരുത്തപ്പെടുന്നില്ല

# accountAlreadyExists
source: An account with this email already exists. Please sign in.
ml: ഈ ഇമെയിലിൽ ഇതിനകം ഒരു അക്കൗണ്ട് നിലവിലുണ്ട്. ദയവായി സൈൻ ഇൻ ചെയ്യുക.

# emailNotConfirmed
source: Your email is not confirmed. Please check your email to verify.
ml: നിങ്ങളുടെ ഇമെയിൽ സ്ഥിരീകരിച്ചിട്ടില്ല. ദയവായി പരിശോധിക്കാൻ നിങ്ങളുടെ ഇമെയിൽ പരിശോധിക്കുക.

source: Reset Your Password
ml: നിങ്ങളുടെ പാസ്സ്വേർഡ് പുനഃസജ്ജമാക്കുക

# setNewPassword
source: Set a New Password
ml: ഒരു പുതിയ പാസ്‌വേഡ് സജ്ജമാക്കുക

# pleaseEnterNewPassword
source: Please enter your new password below.
ml: ദയവായി നിങ്ങളുടെ പുതിയ പാസ്‌വേഡ് താഴെ നൽകുക.

source: New Password
ml: പുതിയ പാസ്സ്വേർഡ്

source: Confirm New Password
ml: പുതിയ പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക

source: Update Password
ml: പാസ്സ്വേർഡ് അപ്ഡേറ്റ് ചെയ്യുക

# passwordUpdatedSuccess
source: Password updated successfully! Please sign in.
ml: പാസ്‌വേഡ് വിജയകരമായി അപ്‌ഡേറ്റ് ചെയ്തു! ദയവായി സൈൻ ഇൻ ചെയ്യുക.

source: Delete Account
ml: അക്കൗണ്ട് ഇല്ലാതാക്കുക

# deleteAccountWarningTitle
source: Are you sure?
ml: ഉറപ്പാണോ?

# deleteAccountWarningMessage
source: This action is permanent and cannot be undone. All your data, including appointments and profile information, will be permanently deleted.
ml: ഈ പ്രവർത്തനം സ്ഥിരമാണ്, പഴയപടിയാക്കാൻ കഴിയില്ല. നിങ്ങളുടെ അപ്പോയിന്റ്മെന്റുകളും പ്രൊഫൈൽ വിവരങ്ങളും ഉൾപ്പെടെ നിങ്ങളുടെ എല്ലാ ഡാറ്റയും ശാശ്വതമായി ഇല്ലാതാക്കപ്പെടും.

source: Delete
ml: ഇല്ലാതാക്കുക

source: Cancel Booking
ml: ബുക്കിംഗ് റദ്ദാക്കുക

# cancelWarningTitle
source: Are you sure?
ml: ഉറപ്പാണോ?

# cancelWarningMessage
source: Are you sure you want to cancel this appointment?
ml: ഈ അപ്പോയിന്റ്മെന്റ് റദ്ദാക്കാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നുവെന്ന് ഉറപ്പാണോ?

# statusCancelled
source: Cancelled
ml: റദ്ദാക്കി

# statusCompleted
source: Completed
ml: പൂർത്തിയായി

source: Booking Details
ml: ബുക്കിംഗ് വിശദാംശങ്ങൾ

source: Close
ml: അടയ്ക്കുക

source: My Medical Records
ml: എന്റെ മെഡിക്കൽ റെക്കോർഡുകൾ

source: Upload New Record
ml: പുതിയ റെക്കോർഡ് അപ്‌ലോഡ് ചെയ്യുക

# fileDescription
source: File Description (e.g., 'Blood Test Results')
ml: ഫയൽ വിവരണം (ഉദാ: 'ബ്ലഡ് ടെസ്റ്റ് റിസൾട്ട്')

source: Upload
ml: അപ്ലോഡ്

source: View
ml: കാണുക

# noRecordsFound
source: You have not uploaded any medical records yet.
ml: നിങ്ങൾ ഇതുവരെ മെഡിക്കൽ രേഖകളൊന്നും അപ്‌ലോഡ് ചെയ്തിട്ടില്ല.

# recordUploadedSuccess
source: Record uploaded successfully!
ml: റെക്കോർഡ് വിജയകരമായി അപ്‌ലോഡ് ചെയ്തു!

# deleteRecordWarningTitle
source: Delete Record?
ml: റെക്കോർഡ് ഇല്ലാതാക്കണോ?

# deleteRecordWarningMessage
source: Are you sure you want to permanently delete this record?
ml: ഈ റെക്കോർഡ് ശാശ്വതമായി ഇല്ലാതാക്കാൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നുവെന്ന് ഉറപ്പാണോ?

# statusConfirmed
source: Confirmed
ml: സ്ഥിരീകരിച്ചു

source: Consulting Time
ml: കൺസൾട്ടിംഗ് സമയം

source: File
ml: ഫയൽ

# validation_timeOutsideHours
source: The selected time is outside the doctor's consulting hours.
ml: തിരഞ്ഞെടുത്ത സമയം ഡോക്ടറുടെ കൺസൾട്ടിംഗ് സമയത്തിന് പുറത്താണ്.

source: Token Number
ml: ടോക്കൺ നമ്പർ

# yourTokenIs
source: Your token number is:
ml: നിങ്ങളുടെ ടോക്കൺ നമ്പർ

# validation_slotUnavailable
source: This time slot is no longer available. Please select a different time.
ml: ഈ ടൈം സ്ലോട്ട് ഇപ്പോൾ ലഭ്യമല്ല. ദയവായി മറ്റൊരു സമയം തിരഞ്ഞെടുക്കുക.

# filterUpcoming
source: Upcoming
ml: വരാനിരിക്കുന്നവ

# filterPast
source: Past / Cancelled
ml: കഴിഞ്ഞ / റദ്ദാക്കിയവ

# noPastAppointments
source: You have no past appointments.
ml: നിങ്ങൾക്ക് കഴിഞ്ഞ അപ്പോയിന്റ്മെന്റുകളൊന്നുമില്ല.

# validation_invalidPlace
source: Please select a valid place from the list.
ml: ദയവായി ലിസ്റ്റിൽ നിന്ന് സാധുവായ ഒരു സ്ഥലം തിരഞ്ഞെടുക്കുക.

source: Timings
ml: സമയം

source: Call Now
ml: ഇപ്പോൾ വിളിക്കുക

source: Get Directions
ml: വഴികൾ നേടുക

source: About
ml: വിവരം

# vision
source: Our Vision
ml: ഞങ്ങളുടെ കാഴ്ചപ്പാട്

# visionContent
source: To create a healthier future by making quality healthcare accessible, affordable, and convenient for everyone, everywhere.
ml: എല്ലായിടത്തും എല്ലാവർക്കും ഗുണനിലവാരമുള്ള ആരോഗ്യപരിരക്ഷ ലഭ്യമാക്കിയും, താങ്ങാനാവുന്നതും, സൗകര്യപ്രദവുമാക്കി മെച്ചപ്പെട്ട ഒരു ഭാവി സൃഷ്ടിക്കുക.

# mission
source: Our Mission
ml: ഞങ്ങളുടെ ദൗത്യം

# missionContent
source: To empower patients and doctors by providing a seamless, intelligent, and secure digital platform that simplifies medical bookings, management, and communication.
ml: മെഡിക്കൽ ബുക്കിംഗുകൾ, മാനേജ്‌മെന്റ്, ആശയവിനിമയം എന്നിവ ലളിതമാക്കുന്ന തടസ്സമില്ലാത്തതും ബുദ്ധിപരവും സുരക്ഷിതവുമായ ഒരു ഡിജിറ്റൽ പ്ലാറ്റ്ഫോം നൽകി രോഗികളെയും ഡോക്ടർമാരെയും ശാക്തീകരിക്കുക.

# validation_nameMinLength
source: Name must be at least 3 characters.
ml: പേരിന് കുറഞ്ഞത് 3 അക്ഷരങ്ങൾ ഉണ്ടായിരിക്കണം.

# validation_phoneInvalid
source: Please enter a valid 10-digit phone number.
ml: ദയവായി 10 അക്കങ്ങളുള്ള സാധുവായ ഫോൺ നമ്പർ നൽകുക.

# validation_ageInvalid
source: Please enter a valid age (0-120).
ml: ദയവായി സാധുവായ ഒരു വയസ്സ് നൽകുക (0-120).

# validation_passwordLength
source: Password must be at least 8 characters.
ml: പാസ്‌വേഡിന് കുറഞ്ഞത് 8 അക്ഷരങ്ങൾ ഉണ്ടായിരിക്കണം.

source: Dashboard
ml: ഡാഷ്ബോർഡ്

source: Schedule
ml: ഷെഡ്യൂൾ

source: Today's Appointments
ml: ഇന്നത്തെ അപ്പോയിന്റ്മെന്റുകൾ

# noAppointmentsToday
source: You have no appointments today.
ml: ഇന്ന് നിങ്ങൾക്ക് അപ്പോയിന്റ്മെന്റുകളൊന്നുമില്ല.

source: All Appointments
ml: എല്ലാ അപ്പോയിന്റ്മെന്റുകളും

source: My Notes
ml: എന്റെ കുറിപ്പുകൾ

# typeYourNoteHere
source: Type your private note here...
ml: നിങ്ങളുടെ സ്വകാര്യ കുറിപ്പ് ഇവിടെ ടൈപ്പ് ചെയ്യുക...

source: Save Note
ml: കുറിപ്പ് സംരക്ഷിക്കുക

source: Note saved!
ml: കുറിപ്പ് സംരക്ഷിച്ചു!

source: Patient Phone
ml: രോഗിയുടെ ഫോൺ

source: Call Patient
ml: രോഗിയെ വിളിക്കുക

source: Edit Schedule
ml: ഷെഡ്യൂൾ എഡിറ്റ് ചെയ്യുക
